tutorials/lagrangian/reactingParcelFoam/liquidFilmStepWithSprinklers/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0) //0
    (5 0 0) //1
    (5 1 0) //2
    (0 1 0) //3
    (-1 0 0.5) //4
    (-1 1 0.5) //5
    (-1 1 1) //6
    (-1 0 1) //7
    (5 1 1) //8
    (0 1 0.5) //9
    (5 0 0.5) //10
    (5 1 0.5) //11
    (0 0 1) //12
    (0 1 1) //13
    (0 0 0.5) //14
    (5 0 1) //15
);

blocks
(
    hex (14 10 11 9 12 15 8 13 ) (100 20 10) simpleGrading (1 1 1)
    hex (0 1 2 3 14 10 11 9) (100 20 10) simpleGrading (1 1 1)
    hex (4 14 9 5 7 12 13 6) (20 20 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    base
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (0 3 9 14)
            (4 14 9 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 11 10)
            (15 10 11 8)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    sides
    {
        type wall;
        faces
        (
            (0 1 10 14)
            (14 10 15 12)
            (4 14 12 7)
            (3 2 11 9)
            (9 11 8 13)
            (5 9 13 6)
        );
    }
    top
    {
        type wall;
        faces
        (
            (12 15 8 13)
            (7 12 13 6)
        );
    }
);


// ************************************************************************* //
